{"feedback 0": "There are 4 Train Systems."}
{"feedback 1": "BKK is the hub of the Railway system that runs throughout parts of Thailand. Generally slow, but cheap (3 classes last time I looked- 1st a bit expensive, 2nd a happy medium and 3rd you are fighting off the chickens!) You get what you pay for."}
{"feedback 2": "There is the Airport Metro Link. BKK centre to the Airport. It is cheap enough (less than 100 Baht) , takes 35 minutes and gets you from the Airport to the city."}
{"feedback 3": "Then there are 2 Metro Lines that criss-cross around the city. The Underground MRT and the overground and above the road Sky Train BTS."}
{"feedback 4": "The BTS and MRT link together in a"}
{"feedback 5": "I’d like to clear up the confusion and if possible simplify the answer. Bangkok has long standing slow suburban rail services but we are not going to talk about that. Information obtained from several online sources are often very confusing and many tourists are led to believe there’s only a couple of lines each for the Skytrain( aka BTS )and MRT ( mostly underground) . BTS and MRT are just the names of the owner companies and each has several lines. Additionally there are also other companies that own the other lines 10 in total. There are at the time of writing 192 stations ( with more openi"}
{"feedback 6": "For majority of local people with average salary in Thailand consider BTS as an expensive transportation."}
{"feedback 7": "Here in the picture below you can see a comparison of the amount of hours minimum wages need to work in exchange of shortest distance - longest distance."}
{"feedback 8": "When I first arrived in Bangkok the Skytrain line was still being built. The year was early 1999 and if memory serves me correct the Thais were not calling it the Skytrain, instead it was called the ‘lot fai far’ which basically means the electric train in the sky. Nowadays most people simple say BTS. This is one aspect of Thailand that beats America hands down."}
{"feedback 9": "Before we ride the BTS, let’s go back to the states and briefly talk about the subway/trains that I have traveled on. My experience has been somewhat limited but then again many metropolitan cities in America simply don’t have any such"}
{"feedback 10": "I think the BTS (aka Skytrain) is one of the best things to have happened to this city."}
{"feedback 11": "Until recently, Bangkok was ranked as one of the world’s top polluted and congested city. While there was plenty of public transport with buses and even canal boats, the roads were more or less constant gridlock."}
{"feedback 12": "Then, at the very end of 1999, the first Skytrain line was opened. Clean, fast, relatively cheap, you could get from one side of the city to the other in 30 minutes instead of hours. What’s not to like? (apart from getting crushed like sardines in a can at peak hours, of course)."}
{"feedback 13": "Then, some years late"}
{"feedback 14": "In Bangkok there is the subway. Significant part is high above traffic, but some is actual subway. This system is wonderful- and has significantly reduced traffic- in a city with WAY too many cars!"}
{"feedback 15": "I have taken “regular” trains. One that runs on weekends to the Bridge over River Kwai. The other was an overnight sleeping train to Chaing Mai- the ancient capital. Nice sleep both ways (I had three of my children with me !)"}
{"feedback 16": "A URL shortener automatically shortens a long link by creating a shortened, easy-to-read URL redirecting to the original link."}
{"feedback 17": "Here’s how a typical link shortener tool works:"}
{"feedback 18": "We love using the BTS system in Bangkok. The cost is low. The trains and the stations are modern and clean. It goes to a fair amount of places and connects to other transport systems. Like everywhere in Thailand and Asia, it is totally safe."}
{"feedback 19": "Can’t think of anything bad to say about it."}
{"feedback 20": "Here’s a quick rundown of the different public transport options in Bangkok."}
{"feedback 21": "Speedboats and Ferries has traditionally been the primary mode of transport. This includes long speed boats and ferries operating on the canals and the Chao Phraya River. The Bangkok Metropolitan Administration is trialing small electric ferries for use in canals. These will be much quieter to operate than long tail boats."}
{"feedback 22": "Every trip to Bangkok won’t be completed for visitors without taking the BTS Skytrain."}
{"feedback 23": "As I have relocated to Bangkok for good. I hope my observation below may be in tune with like-minded commuters who use BTS Skytrain as often as I do."}
{"feedback 24": "You mean this one below"}
{"feedback 25": "Here’s a quick rundown of the different public transport options in Bangkok."}
{"feedback 26": "Speedboats and Ferries has traditionally been the primary mode of transport. This includes long speed boats and ferries operating on the canals and the Chao Phraya River. The Bangkok Metropolitan Administration is trialing small electric ferries for use in canals. These will be much quieter to operate than long tail boats."}
{"feedback 27": "If you’re asking whether the city has a subway or commuter rail system, the answer is, yes, it does."}
{"feedback 28": "It’s a very nice system — or more correctly — set of interconnected systems."}
{"feedback 29": "About two decades ago, two systems were opened."}
{"feedback 30": "The BTS skytrain is was an elevated train line that ran predominately east-west along Sukhumvit Road, with a shorter second line that ran from the river to the Silom area. It was the first such train system to open for operation in Bangkok, and it began operation in the late 1990s."}
{"feedback 31": "A second system, an underground subway called the MRT that opened around the start of the new m"}
{"feedback 32": "There are three trainlines in Bangkok:"}
{"feedback 33": "** BTS = the first system opened in 1999. An elevated train."}
{"feedback 34": "** MRT = the second system opened in 2004. Mostly underground."}
{"feedback 35": "** The Airport Rail Link = the third system opened in 2010. An elevated train to and from the new airport Suvarnabhumi."}
{"feedback 36": "At the moment, more lines are under construction. They are expected to be completed in 5 to 10 years."}
{"feedback 37": "Are these trains superb? I think the answer depends on your expectations and on what the comparison is."}
{"feedback 38": "If we compare with the situation before 2010, before 2004 and before 1999, the trains are superb, because getting aro"}
{"feedback 39": "I have only used the Skytrain & it was very cheap & excellent, it was far better than sitting in a taxi for an hour trying to get from one end of Sukhumvit Road to the other."}
{"feedback 40": "The MRT & BTS railways are good and cheap. The Bangkok traffic means that this is the best way to get around."}
{"feedback 41": "A tip from a former resident, never try to hire a taxi that is parked up, they’ll always try & rip you off. Always hail a moving taxi with his light on. Try and insist that he uses the meter. Taxis are very cheap, I always tip quite well, the drivers are usually quite friendly, and like many Thais, they don’t make much money. Even a small 20 Baht tip is often very much appreciated. I would often give a 100 Baht note (keep the change) for a 73 Baht trip, for example."}
{"feedback 42": "Something that has not been mentioned so far ….. The rail network"}
{"feedback 43": "The rail network is not especially good and most services run north/south from Bangkok, which is great if you live in Bangkok or want to go there. There is very little that runs east/west with two exceptions that I can think of."}
{"feedback 44": "Nakhon Ratchasima (Korat) to Ubon Ratchathani & Bangkok to Aranyaprthet on the border with Cambodia (almost due east)"}
{"feedback 45": "North of Korat, there are no east/west railways routes"}
{"feedback 46": "The trains are slow, but hopefully, with the introduction of the high-speed link from Vientianne (Laos & up to China) to Bangkok, travel"}
{"feedback 47": "The answer, in short is YES. BKK has excellent and extremely affordable public transportation. BUT it’s multi layered, overlapping, complicated to figure out… and only about 1/3 of the postings are in English… but the path can be discovered if you have patience and aren’t afraid to ask for directions."}
{"feedback 48": "The BTS & MRT systems in Bangkok despite being overcrowded during their long peak hours are generally very good."}
{"feedback 49": "The rest of the public transport is, by any measure, unreliable. It seems that Thais that have never lived outside of Thailand find it acceptable."}
{"feedback 50": "I have lived in many countries, both developed and developing - ranging from Japan to Vietnam and almost everything in between, and find Thailand to be about average."}
{"feedback 51": "If you need to use the Thai public transport infrastructure just get used to its unreliable services and plan for them."}
{"feedback 52": "Have very low expectations and avoid disappointment.😊"}
{"feedback 53": "Train only goes as far as Chiang Mai. You'll need to take a bus from there. But the Bangkok to Chiang Mai 2nd class is comfortable. Overnight is usually the best way to make the trip and not waste a travel day."}
{"feedback 54": "My wife and I took the orange bus no.1 from Bangrak in Silom district. As the bus approached Chinatown, we noticed an elderly man with a limp on his left leg getting up and preparing to alight."}
{"feedback 55": "The man said to the bus driver, “Go slow, allow me to alight, my leg isn’t that good.”"}
{"feedback 56": "The bus driver replied, “If the leg is no good! cut it off, you come forward to the exit, step down, ready to alight- Uncle!” My wife was giggling and amused by what he said."}
{"feedback 57": "After the man had alighted, immediately the driver drove to the extreme right lane, amidst a loud cheering with beaming eyes from his sidekick, a b"}
{"feedback 58": "I say it’s hard to answer this question since I was born and raised there."}
{"feedback 59": "Of course it’s not so good if compare with big cities like New York, London, Tokyo or Paris."}
{"feedback 60": "I would say the metro (MRT) and the sky train (BTS) systems are good."}
{"feedback 61": "Buses are ok. Thet are always there, but there is no timetable whatsoever."}
{"feedback 62": "A taxi is very affordable compared with western countries."}
{"feedback 63": "Yes. The Blue Line MRT is Bangkok's first underground metro. The first full underground section between Hua Lamphong and Bang Sue (20km) commenced service in 2004."}
{"feedback 64": "Because rice and chicken is cheaper than buying trains from Siemens and building major infrastructure."}
{"feedback 65": "With most things in Thailand, anything produced locally is very affordable. Anything imported is not."}
{"feedback 66": "Simply because Bangkok is a very expensive city. I suggest if you have offering to work at Bangkok, ask for big salary because everything is very damned expensive here. Not to mention most people cannot speak English so good luck finding promotion and cheap goods enjoyed by local Thai."}
{"feedback 67": "It's like most systems in South East Asian countries comparable to Beijing, Shanghai, Hanoi or HCMC but better than Kuala Lumpur (in service and safety), Jakarta (in service), Yangon (where buses are older) but far behind Singapore, Japan or Seoul."}
{"feedback 68": "They have 2 kinds of buses, the older ones without a/c and those with a/c. I like that all their buses have a bus attendant to sell ticket and he/she look after the passengers well although they usually don't speak English, compared to Kuala Lumpur where there are no bus conductor and the bus will drive will just simply brake or stop and speed withou"}
{"feedback 69": "Depends on what's your expectations or definitions for superb but why on just the trains and not the whole system?"}
{"feedback 70": "If comparing with Kuala Lumpur's systems, Bangkok's systems especially their stations’ designs, maintenance and cleanliness are far far better."}
{"feedback 71": "There is no central station as such as the various train systems interchange at different stations. I am assuming that you are coming from the airport and want to take the train south out of Bangkok?"}
{"feedback 72": "If so by far the easiest way is the following:"}
{"feedback 73": "Take the airport train to Makkasan station (Not Phaya Thai). Get off at Makkasan and at road level you can enter the subway which is called Phetchaburi station. From there you just take the line all the way to the end at Hua Lamphong which is the main Railway terminal out of Bangkok where 99% of all trains leave from. SO you only need to change once at"}
{"feedback 74": "Don't make me laugh. See this photo?"}
{"feedback 75": "The metro was officially opened 3 July 2004 by Him King Bhumibol and Queen Sirikit. 19 three-car trains have been supplied by Siemens. There are three types of platforms within the Bangkok MRT System."}
{"feedback 76": "There are 3 railway systems ( it's expanding rapidly as well ). One railway system connects the main airport with central Bangkok. One system, the Skytrain runs from Mo Chit in the north to On Nut in the east, via SIAM station in the centre. With a spur going south west to the river and then west. The last system, the underground, runs from Hua Lamphung the old railway station and travels through the near East of the city to Mo Chit. You have lots of stations to choose from in the central part of the city. Prices range from about 25baht for a short ride to 45baht for a long ride. There is a da"}
{"feedback 77": "The elevated train (MRT) is the only way to be able to manage your travel time, because then you avoid traffic jams; my friends have gotten out of their limousines to get on time to business meetings by MRT, leaving their drivers to follow in their cars to take them back to their offices."}
{"feedback 78": "Public buses are the worst (but cheapest) way to get around Bangkok. Drivers drive recklessly, as they race each other to pick up passengers (drivers are paid a commission based on fare revenue). You may have to jump on/off if the driver’s not willing to come to a full stop. We have infamous traffic jams."}
{"feedback 79": "I liv"}
{"feedback 80": "I will leave Singapore out here."}
{"feedback 81": "Before answering this I will mention that MRT is not part of railway system. They are separate things."}
{"feedback 82": "Thailand is the best if we consider connectivity."}
{"feedback 83": "If you are talking about modernity then no. Both indonesia and Malaysia has better trains. If I am not wrong Malays..."}
{"feedback 84": "I wouldn’t recommend long distance trains in Thailand. I have done long distance trips here several times and been disappointed on most of them. The issues are:"}
{"feedback 85": "Slow speed. It is faster by road."}
{"feedback 86": "Dangerous. Derailments are common in Thailand, as the track can be in poor condition in places. Security on board is patchy. The train guards are armed and the carriages are locked at night, but incidences of attacks and thefts from individuals, particularly lone females, have been reported."}
{"feedback 87": "Old rolling stock. All the carriages and engines are at least 30 years old."}
{"feedback 88": "Diesel smells. All the services are dies"}
{"feedback 89": "Because basically there isn’t one ! there is a train which runs, once a day, from Rayon to Bangkok a distance of about 150kms. It takes 9 hours ! it stops at every small station on the way. By car about 2 hours on very good motorways. There is one I understand from Chang Mai to Bangkok which is just as bad."}
{"feedback 90": "I would say via a Tuk-Tuk."}
{"feedback 91": "The other way is via their transit system. THe so called LRT (Sky Train/Subway) is very easy to understand and the LRT map is in english."}
{"feedback 92": "If you want to visit, they have some nice tours you can take"}
{"feedback 93": "Just remember - getting lost is a bummer in Bangkok. Don’t do it!"}
