{"feedback 0": "There are 4 Train Systems."}
{"feedback 1": "BKK is the hub of the Railway system that runs throughout parts of Thailand. Generally slow, but cheap (3 classes last time I looked- 1st a bit expensive, 2nd a happy medium and 3rd you are fighting off the chickens!) You get what you pay for."}
{"feedback 2": "There is the Airport Metro Link. BKK centre to the Airport. It is cheap enough (less than 100 Baht) , takes 35 minutes and gets you from the Airport to the city."}
{"feedback 3": "Then there are 2 Metro Lines that criss-cross around the city. The Underground MRT and the overground and above the road Sky Train BTS."}
{"feedback 4": "The BTS and MRT link together in a"}
{"feedback 5": "I’d like to clear up the confusion and if possible simplify the answer. Bangkok has long standing slow suburban rail services but we are not going to talk about that. Information obtained from several online sources are often very confusing and many tourists are led to believe there’s only a couple of lines each for the Skytrain( aka BTS )and MRT ( mostly underground) . BTS and MRT are just the names of the owner companies and each has several lines. Additionally there are also other companies that own the other lines 10 in total. There are at the time of writing 192 stations ( with more openi"}
{"feedback 6": "For majority of local people with average salary in Thailand consider BTS as an expensive transportation."}
{"feedback 7": "Here in the picture below you can see a comparison of the amount of hours minimum wages need to work in exchange of shortest distance - longest distance."}
{"feedback 8": "When I first arrived in Bangkok the Skytrain line was still being built. The year was early 1999 and if memory serves me correct the Thais were not calling it the Skytrain, instead it was called the ‘lot fai far’ which basically means the electric train in the sky. Nowadays most people simple say BTS. This is one aspect of Thailand that beats America hands down."}
{"feedback 9": "Before we ride the BTS, let’s go back to the states and briefly talk about the subway/trains that I have traveled on. My experience has been somewhat limited but then again many metropolitan cities in America simply don’t have any such"}
{"feedback 10": "I think the BTS (aka Skytrain) is one of the best things to have happened to this city."}
{"feedback 11": "Until recently, Bangkok was ranked as one of the world’s top polluted and congested city. While there was plenty of public transport with buses and even canal boats, the roads were more or less constant gridlock."}
{"feedback 12": "Then, at the very end of 1999, the first Skytrain line was opened. Clean, fast, relatively cheap, you could get from one side of the city to the other in 30 minutes instead of hours. What’s not to like? (apart from getting crushed like sardines in a can at peak hours, of course)."}
{"feedback 13": "Then, some years late"}
{"feedback 14": "In Bangkok there is the subway. Significant part is high above traffic, but some is actual subway. This system is wonderful- and has significantly reduced traffic- in a city with WAY too many cars!"}
{"feedback 15": "I have taken “regular” trains. One that runs on weekends to the Bridge over River Kwai. The other was an overnight sleeping train to Chaing Mai- the ancient capital. Nice sleep both ways (I had three of my children with me !)"}
{"feedback 16": "We love using the BTS system in Bangkok. The cost is low. The trains and the stations are modern and clean. It goes to a fair amount of places and connects to other transport systems. Like everywhere in Thailand and Asia, it is totally safe."}
{"feedback 17": "Can’t think of anything bad to say about it."}
{"feedback 18": "Here’s a quick rundown of the different public transport options in Bangkok."}
{"feedback 19": "Speedboats and Ferries has traditionally been the primary mode of transport. This includes long speed boats and ferries operating on the canals and the Chao Phraya River. The Bangkok Metropolitan Administration is trialing small electric ferries for use in canals. These will be much quieter to operate than long tail boats."}
{"feedback 20": "A URL shortener automatically shortens a long link by creating a shortened, easy-to-read URL redirecting to the original link."}
{"feedback 21": "Here’s how a typical link shortener tool works:"}
{"feedback 22": "Every trip to Bangkok won’t be completed for visitors without taking the BTS Skytrain."}
{"feedback 23": "As I have relocated to Bangkok for good. I hope my observation below may be in tune with like-minded commuters who use BTS Skytrain as often as I do."}
{"feedback 24": "You mean this one below"}
{"feedback 25": "Here’s a quick rundown of the different public transport options in Bangkok."}
{"feedback 26": "Speedboats and Ferries has traditionally been the primary mode of transport. This includes long speed boats and ferries operating on the canals and the Chao Phraya River. The Bangkok Metropolitan Administration is trialing small electric ferries for use in canals. These will be much quieter to operate than long tail boats."}
{"feedback 27": "If you’re asking whether the city has a subway or commuter rail system, the answer is, yes, it does."}
{"feedback 28": "It’s a very nice system — or more correctly — set of interconnected systems."}
{"feedback 29": "About two decades ago, two systems were opened."}
{"feedback 30": "The BTS skytrain is was an elevated train line that ran predominately east-west along Sukhumvit Road, with a shorter second line that ran from the river to the Silom area. It was the first such train system to open for operation in Bangkok, and it began operation in the late 1990s."}
{"feedback 31": "A second system, an underground subway called the MRT that opened around the start of the new m"}
{"feedback 32": "There are three trainlines in Bangkok:"}
{"feedback 33": "** BTS = the first system opened in 1999. An elevated train."}
{"feedback 34": "** MRT = the second system opened in 2004. Mostly underground."}
{"feedback 35": "** The Airport Rail Link = the third system opened in 2010. An elevated train to and from the new airport Suvarnabhumi."}
{"feedback 36": "At the moment, more lines are under construction. They are expected to be completed in 5 to 10 years."}
{"feedback 37": "Are these trains superb? I think the answer depends on your expectations and on what the comparison is."}
{"feedback 38": "If we compare with the situation before 2010, before 2004 and before 1999, the trains are superb, because getting aro"}
{"feedback 39": "I have only used the Skytrain & it was very cheap & excellent, it was far better than sitting in a taxi for an hour trying to get from one end of Sukhumvit Road to the other."}
{"feedback 40": "The MRT & BTS railways are good and cheap. The Bangkok traffic means that this is the best way to get around."}
{"feedback 41": "A tip from a former resident, never try to hire a taxi that is parked up, they’ll always try & rip you off. Always hail a moving taxi with his light on. Try and insist that he uses the meter. Taxis are very cheap, I always tip quite well, the drivers are usually quite friendly, and like many Thais, they don’t make much money. Even a small 20 Baht tip is often very much appreciated. I would often give a 100 Baht note (keep the change) for a 73 Baht trip, for example."}
{"feedback 42": "Something that has not been mentioned so far ….. The rail network"}
{"feedback 43": "The rail network is not especially good and most services run north/south from Bangkok, which is great if you live in Bangkok or want to go there. There is very little that runs east/west with two exceptions that I can think of."}
{"feedback 44": "Nakhon Ratchasima (Korat) to Ubon Ratchathani & Bangkok to Aranyaprthet on the border with Cambodia (almost due east)"}
{"feedback 45": "North of Korat, there are no east/west railways routes"}
{"feedback 46": "The trains are slow, but hopefully, with the introduction of the high-speed link from Vientianne (Laos & up to China) to Bangkok, travel"}
{"feedback 47": "The answer, in short is YES. BKK has excellent and extremely affordable public transportation. BUT it’s multi layered, overlapping, complicated to figure out… and only about 1/3 of the postings are in English… but the path can be discovered if you have patience and aren’t afraid to ask for directions."}
{"feedback 48": "The BTS & MRT systems in Bangkok despite being overcrowded during their long peak hours are generally very good."}
{"feedback 49": "The rest of the public transport is, by any measure, unreliable. It seems that Thais that have never lived outside of Thailand find it acceptable."}
{"feedback 50": "I have lived in many countries, both developed and developing - ranging from Japan to Vietnam and almost everything in between, and find Thailand to be about average."}
{"feedback 51": "If you need to use the Thai public transport infrastructure just get used to its unreliable services and plan for them."}
{"feedback 52": "Have very low expectations and avoid disappointment.😊"}
{"feedback 53": "Train only goes as far as Chiang Mai. You'll need to take a bus from there. But the Bangkok to Chiang Mai 2nd class is comfortable. Overnight is usually the best way to make the trip and not waste a travel day."}
{"feedback 54": "My wife and I took the orange bus no.1 from Bangrak in Silom district. As the bus approached Chinatown, we noticed an elderly man with a limp on his left leg getting up and preparing to alight."}
{"feedback 55": "The man said to the bus driver, “Go slow, allow me to alight, my leg isn’t that good.”"}
{"feedback 56": "The bus driver replied, “If the leg is no good! cut it off, you come forward to the exit, step down, ready to alight- Uncle!” My wife was giggling and amused by what he said."}
{"feedback 57": "After the man had alighted, immediately the driver drove to the extreme right lane, amidst a loud cheering with beaming eyes from his sidekick, a b"}
{"feedback 58": "I say it’s hard to answer this question since I was born and raised there."}
{"feedback 59": "Of course it’s not so good if compare with big cities like New York, London, Tokyo or Paris."}
{"feedback 60": "I would say the metro (MRT) and the sky train (BTS) systems are good."}
{"feedback 61": "Buses are ok. Thet are always there, but there is no timetable whatsoever."}
{"feedback 62": "A taxi is very affordable compared with western countries."}
{"feedback 63": "Yes. The Blue Line MRT is Bangkok's first underground metro. The first full underground section between Hua Lamphong and Bang Sue (20km) commenced service in 2004."}
{"feedback 64": "Because rice and chicken is cheaper than buying trains from Siemens and building major infrastructure."}
{"feedback 65": "With most things in Thailand, anything produced locally is very affordable. Anything imported is not."}
{"feedback 66": "Simply because Bangkok is a very expensive city. I suggest if you have offering to work at Bangkok, ask for big salary because everything is very damned expensive here. Not to mention most people cannot speak English so good luck finding promotion and cheap goods enjoyed by local Thai."}
{"feedback 67": "It's like most systems in South East Asian countries comparable to Beijing, Shanghai, Hanoi or HCMC but better than Kuala Lumpur (in service and safety), Jakarta (in service), Yangon (where buses are older) but far behind Singapore, Japan or Seoul."}
{"feedback 68": "They have 2 kinds of buses, the older ones without a/c and those with a/c. I like that all their buses have a bus attendant to sell ticket and he/she look after the passengers well although they usually don't speak English, compared to Kuala Lumpur where there are no bus conductor and the bus will drive will just simply brake or stop and speed withou"}
{"feedback 69": "Depends on what's your expectations or definitions for superb but why on just the trains and not the whole system?"}
{"feedback 70": "If comparing with Kuala Lumpur's systems, Bangkok's systems especially their stations’ designs, maintenance and cleanliness are far far better."}
{"feedback 71": "There is no central station as such as the various train systems interchange at different stations. I am assuming that you are coming from the airport and want to take the train south out of Bangkok?"}
{"feedback 72": "If so by far the easiest way is the following:"}
{"feedback 73": "Take the airport train to Makkasan station (Not Phaya Thai). Get off at Makkasan and at road level you can enter the subway which is called Phetchaburi sta"}
{"feedback 74": "Don't make me laugh. See this photo?"}
{"feedback 75": "The metro was officially opened 3 July 2004 by Him King Bhumibol and Queen Sirikit. 19 three-car trains have been supplied by Siemens. There are three types of platforms within the Bangkok MRT System."}
{"feedback 76": "There are 3 railway systems ( it's expanding rapidly as well ). One railway system connects the main airport with central Bangkok. One system, the Skytrain runs from Mo Chit in the north to On Nut in the east, via SIAM station in the centre. With a spur going south west to the river and then west. The last system, the underground, runs from Hua Lamphung the old railway station and travels through the near East of the city to Mo Chit. You have lots of stations to choose from in the central part of the city. Prices range from about 25baht for a short ride to 45baht for a long ride. There is a da"}
{"feedback 77": "The elevated train (MRT) is the only way to be able to manage your travel time, because then you avoid traffic jams; my friends have gotten out of their limousines to get on time to business meetings by MRT, leaving their drivers to follow in their cars to take them back to their offices."}
{"feedback 78": "Public buses are the worst (but cheapest) way to get around Bangkok. Drivers drive recklessly, as they race each other to pick up passengers (drivers are paid a commission based on fare revenue). You may have to jump on/off if the driver’s not willing to come to a full stop. We have infamous traffic jams."}
{"feedback 79": "I liv"}
{"feedback 80": "I will leave Singapore out here."}
{"feedback 81": "Before answering this I will mention that MRT is not part of railway system. They are separate things."}
{"feedback 82": "Thailand is the best if we consider connectivity."}
{"feedback 83": "If you are talking about modernity then no. Both indonesia and Malaysia has better trains. If I am not wrong Malays..."}
{"feedback 84": "I wouldn’t recommend long distance trains in Thailand. I have done long distance trips here several times and been disappointed on most of them. The issues are:"}
{"feedback 85": "Slow speed. It is faster by road."}
{"feedback 86": "Dangerous. Derailments are common in Thailand, as the track can be in poor condition in places. Security on board is patchy. The train guards are armed and the carriages are locked at night, but incidences of attacks and thefts from individuals, particularly lone females, have been reported."}
{"feedback 87": "Old rolling stock. All the carriages and engines are at least 30 years old."}
{"feedback 88": "Diesel smells. All the services are dies"}
{"feedback 89": "Because basically there isn’t one ! there is a train which runs, once a day, from Rayon to Bangkok a distance of about 150kms. It takes 9 hours ! it stops at every small station on the way. By car about 2 hours on very good motorways. There is one I understand from Chang Mai to Bangkok which is just as bad."}
{"feedback 90": "I would say via a Tuk-Tuk."}
{"feedback 91": "The other way is via their transit system. THe so called LRT (Sky Train/Subway) is very easy to understand and the LRT map is in english."}
{"feedback 92": "If you want to visit, they have some nice tours you can take"}
{"feedback 93": "Just remember - getting lost is a bummer in Bangkok. Don’t do it!"}
{"feedback 94": "I traveled by train from Bangkok to Chaing mai and also back to Bangkok , I had no problems as far as the process goes trains ran on time. also have gone to Krabi by train, thought the process was smooth. it is a cheaper way to travel."}
{"feedback 95": "1st President: Busy fending off Dutch re-occupation. Busy with rebellion and separatist movements. Busy with building monuments and confrontation with Malaysia (OK, his bad). Probably busy with the ladies too."}
{"feedback 96": "2nd President: Busy dividing businesses among his kids and cronies."}
{"feedback 97": "3rd-5th President: Busy keeping Indonesia from going bankrupt and/or disintegrating. The combined duration of their reign is"}
{"feedback 98": "Thailand, or Bangkok?"}
{"feedback 99": "The MTR, BTS, and BRT services in Bangkok are as good as anywhere in the world. The only area the fall down in is not having an integrated ticketing system."}
{"feedback 100": "To get to the nearest station there is a choice of motorbike taxi, costing usually 20 Baht ($1), or Songtaew (Red trucks with two rows of bench seats) that cost 5 Baht."}
{"feedback 101": "Then there are normal taxis. You can get from one side of Bangkok to the other, or from central Bangkok to the Airport, for less than 500 Baht ($20). Most trips within Bangkok will be 100 to 200 Baht."}
{"feedback 102": "There are also tuk tuks, locals use them, but if you do"}
{"feedback 103": "Alright, let's break it down. Why do some people consider traveling by train more luxurious than flying?"}
{"feedback 104": "Imagine this: you're gliding through the picturesque countryside, a glass of fine wine in hand, and a delectable vegan meal in front of you. You're not crammed into a tiny seat with someone’s elbow in your rib, nor are you doing the awkward shuffle past a sleeping stranger to get to the bathroom. On a train, you have space, comfort, and the kind of relaxed atmosphere that makes you feel like you’re actually on a holiday, not just hurtling towards your destination."}
{"feedback 105": "Trains offer something airpl"}
{"feedback 106": "The one that ask this question should look at statistic first,"}
{"feedback 107": "I’ve never heard anyone describing Thailand’s railway infrastructure as excellent. I would say the infrastructure is quite deficient. For instance existing intercity rail services (with exception of long distance services) are quite poor. Rail freight logistic is still under developed and under-utilised."}
{"feedback 108": "Existing transport infrastructure is still heavily road based. There is only 4,000km of railway but over 350,000km of roads. The railway serves 35 million passengers per annum, less than domestic airline passengers of 38.4 million (pre Covid-19 level). Rail transport represents only a 1% share"}
{"feedback 109": "You mean this one below"}
{"feedback 110": "Infrastructure is more than trains I guess…."}
{"feedback 111": "Take for example the north of Thailand which I probably know best, there are modern airports with domestic flights and some airports also international flight in every other city in the north. Chiang Mai has an international airport, Chiang Rai has also an international airport. Nan, Lampang, Mae Hong Son, Mae Sot, Phitsanulok, Phrae and others have airports with several domestic flights every day. Take gor example Lampang airport which is situated only 100 kms from Chiang Mai airport, it has 7 daily flights to Bangkok, both Don Muang and Suvannabhum"}
{"feedback 112": "If you mean infrastructure to get around the country then Thailand has a good infrastructure. It is very easy to get from A to B anywhere in Thailand. Even with covid we have many internal flights between all the major cities, trains to the North, North East, East, South again linking the major cities. Buses run round the clock to all destinations. The roads are of high quality everywhere and it is easy to hire a car. I just cycle from Chumphon to Yala in the south and the roads are perfect. In Bangkok we have sky trains and MRT all being extended to link all parts of the city. You don't need"}
{"feedback 113": "This is an accusation that doesn't match what we experience in traveling around Thailand. There is no “sugargoating” here."}
{"feedback 114": "They have excellent Infrastructure, quite developed, except in poor rural areas (which we see in many so called “First World” countries too)."}
{"feedback 115": "I suspect the real answer may be the nationality of the person who asked this question and why they dislike Thailand………………..…For a related kind of example, if China is being attacked on line, we can assume the questioner is either from India or a US Trump supporter, or a naive Aussie or British person who believes what the current US p"}
{"feedback 116": "Yes the trains to the provinces have not be updated much as trains does not play much part as the road and air transport. But The Sky train and other local links BRT, MRT etc have been updated and superbly maintained."}
{"feedback 117": "You may think Bangkok is better in real estate by seeing the tall buildings and the malls. Other provinces have restrictions in construction of the tall buildings as Thailand like Europe wants to maintain with less taller buildings but spreading them instead making it less congestable and polluted. Infrastrcture refers mainly to roads and bridges, Airports etc which Thailand has d"}
{"feedback 118": "Most Thai’s living outside from Bangkok, don’t know what MRT really is!"}
{"feedback 119": "There are three trainlines in Bangkok:"}
{"feedback 120": "** BTS = the first system opened in 1999. An elevated train."}
{"feedback 121": "** MRT = the second system opened in 2004. Mostly underground."}
{"feedback 122": "** The Airport Rail Link = the third system opened in 2010. An elevated train to and from the new airport Suvarnabhumi."}
{"feedback 123": "At the moment, more lines are under construction. They are expected to be completed in 5 to 10 years."}
{"feedback 124": "Are these trains superb? I think the answer depends on your expectations and on what the comparison is."}
{"feedback 125": "If we compare with the situation before 2010, before 2004 and before 1999, the trains are superb, because getting aro"}
{"feedback 126": "Yes, if it mean safe to your life"}
{"feedback 127": "I don’t think there was a major accident relate to train in last decade\nThere were small problems here and there\nSky train and Subway sometime stop with ‘technical problem’ time to time\nMRT had crash once in early day of service, small accident no one die or serious damage\nMain line train, well… too old to have a serious problem as it has very slow speed\nBut it always has a problem if you want to goes by main line train across the country, you may want to put a lot of spare time in your schedule. Train arrive late is something common, if you got a very bad luck"}
{"feedback 128": "Before I proceed with answering your question, let me remind you that only Bangkok has modern and sophisticated mass transit system. Other major cities in Thailand like Hatyai or Chiang Mai has none of them."}
{"feedback 129": "The same goes with Malaysia while Kuala Lumpur has first world mass transit system, other major cities like Johor Bahru or Penang has no mass transit system and only relying on city buses for commuter shuttle."}
{"feedback 130": "We have to admit the mass transit system in Jakarta may be “awful” when compared to Bangkok, at least they’re exist and much more diverse than Bangkok."}
{"feedback 131": "In addition, Jakarta is not the o"}
{"feedback 132": "No, they don’t. Foreigners who hail the mass rapid transit in Bangkok as if the best thing ever—They are not wrong."}
{"feedback 133": "Bangkok, the capital city has been a popular city ever since 8-million tourists started coming to the Far East in the 60s. Thailand was the only KNOWN Country competing with Singapore in the 60s, during which time when tourists were told to bring along their toilet papers and Malaria tablets when coming to Thailand."}
{"feedback 134": "Trishaw, trams, and packed buses."}
{"feedback 135": "I don’t know foreigners that say that, but my guess is that the foreigners who do say it so much appreciate the good parts of Thailand that they overlook some of the weaker parts. Compared to other developed countries, I think Thailand does not have a good developed infrastructure, thoughit’s airports seem to be modern, and it is working on upgrading its rail service."}
{"feedback 136": "My guess - for what little it's worth - is that the foreigners gushing here on Quora are mostly Americans, whose experience of transit systems at home is of a level of shabby mismanagement, with public money spent primarily on capital, with little or no thought to improving operation. I can readily see that the American polity does encourage this - Capital Spending must produce Results in the short term - and this means spending on hardware that can be shown off, in a year or two's time, for election purposes. Building ridership, which means a low-pressure change in general habits, and subsidi"}
{"feedback 137": "I think you should compare apples to apples and say, the USA compared to China. I can rephrase your question: why does public transportation in the USA look like a complete joke when compared to Thailand? There is your tough question back. Thailand has a great system. Perhaps no bullet trains, but I can cross the entire country for 12 US dollars, many mini-buses with vast routes, coming by every 15 minutes or so, compared with Madison, Wisconsin, sometimes one bus an hour, gonna cost you $1.25 and you will still walk quite a ways. Forget about trains…it is a car-nation."}
{"feedback 138": "because Thailand is poor when thai have MRT it made Thai happy and consider they have a great public transportation already comparing to World War II open air buses in Bangkok."}
{"feedback 139": "In a way yes. Thai trains can be slow too. But I found less variety in Thai choices of trains."}
{"feedback 140": "And the train network isn't that good in Thailand. You cannot go many places on train. Neither can u go there through air. All hail the motorways which are excellent."}
{"feedback 141": "Thai trains are less smelly than average Indian trains, but efficiency wise I will say its poorer."}
{"feedback 142": "Maybe because more foreigner go to Thailand?"}
{"feedback 143": "From what i have seen in Malaysia there are less foreigners using mrt in Malaysia. Most foreigners use Grab in Malaysia don't know about mrt in bangkok as i didn't use it when i go there but i assume more foreigners use them to go to tourist places."}
{"feedback 144": "It is convenience in order to get from one place to another for a quick travel trip but very expensive fares if compare to other country such as MRT in Singapore."}
{"feedback 145": "China has a different view on most subjects."}
{"feedback 146": "To China public transport is an asset that helps grow the economy."}
{"feedback 147": "To most countries public transport is a liability. You “find\" the money to fund it because you will lose votes and power."}
{"feedback 148": "They try to be helpful usually. Sometimes they don’t know the answer and they won’t like to lose face so they will tell you something incorrect rather than admit they don’t know."}
{"feedback 149": "A “ Complete joke” is rather harsh! Public transportation in Bangkok is actually very good. The rest of Thailand public transportation is improving with new rail road lines."}
{"feedback 150": "Depending on the track conditions and availability of locomotives, it can be delayed 1–2 hours… not to mention about level crossing accidents"}
{"feedback 151": "Yes safe but very slow and also cheaper than Bus"}
{"feedback 152": "Yes they are. If you take any trains you should still be aware of your belongings as you would in any other country."}
{"feedback 153": "It only costs Rm30/month or usd 7.5 for UNLIMITED rides on rapidly buses, mrt buses, MRT , LRT, Monorails, BRT in Malaysia ,meanwhile your country leader is arguing whether 104 baht per trip is already cheap in Bangkok"}
{"feedback 154": "Depends on what's your expectations or definitions for superb but why on just the trains and not the whole system?"}
{"feedback 155": "If comparing with Kuala Lumpur's systems, Bangkok's systems especially their stations’ designs, maintenance and cleanliness are far far better."}
{"feedback 156": "If I am not wrong Thailand doesn't manufacture trains but the imported coaches from Japan/China that travels from Bangkok to chiang Mai is ok."}
{"feedback 157": "Otherwise for the most part trains are not that great in Thailand. It still has narrow gauge tracks so that's why trains cannot yet be upgraded beyond 90 kmph. Another funny thing is you can go from Bangkok to Chiang Mai or say bangkok to hua hin but you can"}
{"feedback 158": "Sky train and underground. Clean, quick, reliable, inexpensive, easy to use. Covers most parts of the city that tourists want to see, though not all of it. Get a map or check out website. Only negative is the trains are always crowded. I have been using for years and never had a problem."}
{"feedback 159": "There is no a single answer for this, Bangkok is huge, so huge that you can’t rely on one transportation mode. BTS and MRT network is not that extensive, yet. Bangkok is not like Singapore where you can hop on any trains to all tourism attractions."}
{"feedback 160": "If you love exploring temples, palace, other historical buildings, and backpacker area of Khaosan Road, then tuk-tuk is your best bet. Those places are"}
{"feedback 161": "First of all , for visitors, I don’t recommend normal taxis or Tuk Tuks because a significant number of them will try to cheat you. My preferred modes of transport in Bangkok"}
{"feedback 162": "Bus: cheap as chips, go everywhere, but traffic"}
{"feedback 163": "BTS / MRT, more lines now, quick, aircon, good for central areas, more lines being built but still fairly limited for a city the size of bangkok"}
{"feedback 164": "River taxi, good for going up and down the Chao Phraya obviously, very cheap, nice breeze, other boat services go in lesser canals etc"}
{"feedback 165": "Motorbike:good for getting around in heavy traffic, but you can't use the expressway, and there are some bridges you can't go over, and the police do regular stops getting people for that."}
{"feedback 166": "Bicycle : local area only better, takes a certain type of madman"}
{"feedback 167": "Walk, okay for local ar"}
{"feedback 168": "There are two things to remember here:"}
{"feedback 169": "In terms of non-China specific considerations, remember:"}
{"feedback 170": "Airplanes are popular. To get to a region that's not too far away, people often book a “transfer\". Usually a minivan that takes you a hundred miles away for roughly $100."}
{"feedback 171": "Once at destination, popular options for short distances are auto rickshaws (“tuktuks”) or a rental scooter (called “bike\" or “motorbike\". A motorcycle is called \"big bike\"). You can also get a proper car. Download apps like Grab or Bolt, enter destination and see how much it costs. Same as Uber, just a different app. Or hail a taxi, but make sure they use the meter or agree to transport you for the same price as the apps."}
{"feedback 172": "Walking (and sweating), Turk Tuk (motorcycle rickshaw), Sorng Tao (private public transit, bench seats in the back of a pick up), taxi, motorcycle taxi, bus, auto, BTS (sky train), and my personal favorite Dragon Tailed Boat water taxi."}
{"feedback 173": "like the parson’s egg - good in parts."}
{"feedback 174": "The buses are very cheap but also chaotic."}
{"feedback 175": "Tuk-tuks are to be avoided -they are a law unto themselves - use one for the experience than discard."}
{"feedback 176": "Motorcycle taxis - agree the price first - you should rally have a helmet!!!"}
{"feedback 177": "Taxis should AWAYS use a meter. (you could agree a price before getting in)"}
{"feedback 178": "BTS and MRT train services are modern and efficient - contactless payment etc - they re limited in where you ca go but good for getting around central Bangkok - the BTS has been expanded and is more useful now."}
{"feedback 179": "From the airport their is a n official tai desk on the gro"}
{"feedback 180": "The best way to get around Bangkok is by Skytrain or Metro, which is fast, affordable and easily navigable for visitors. The city also offers an extensive network of buses, but these are prone to traffic jams, which the city is notorious for. Taxis are fairly cheap, but again, gridlock is a regular issue."}
{"feedback 181": "I would say via a Tuk-Tuk."}
{"feedback 182": "The other way is via their transit system. THe so called LRT (Sky Train/Subway) is very easy to understand and the LRT map is in english."}
{"feedback 183": "If you want to visit, they have some nice tours you can take"}
{"feedback 184": "Just remember - getting lost is a bummer in Bangkok. Don’t do it!"}
{"feedback 185": "Look at Thailand on a map – the country resembles an elephant's head. Stretching for more than 1000 miles (1610km) from Chiang Rai in the north (our Babar's right ear) to Narathiwat in the south (the trunk's end), there's plenty of jungle, road and shoreline for travelers to cover. Fortunately, the country's excellent, integrated transport system makes it easy to get around."}
{"feedback 186": "Getting around in Thailand: your transportation guide"}
{"feedback 187": "Look at Thailand on a map – the country resembles an elephant's head. Stretching for more than 1000 miles (1610km) from Chiang Rai in the north (our Babar's right ear) to"}
{"feedback 188": "The best way to get around is by the BTS (SkyTrain) system followed by the underground Metro system. A day ticket for 24 hours costs 140 Baht for each."}
{"feedback 189": "Overground by BTS, underground by MRT."}
{"feedback 190": "Overground buses are fine if you can work out where they are going!"}
{"feedback 191": "Use meter taxis or Bolt for short distance and make sure they put the clock on. Forget tuktuks (ripoff) and motorbike taxis unless you have a deathwish."}
{"feedback 192": "Walking can be interesting too."}
{"feedback 193": "BTS (Skytrain) and MRT are the local rail systems. Both of these will get you most places around Bangkok and I normally catch a taxi or motorcycle if I don’t want to work from the station. I’ve driven around and through Bangkok many times and it can be done but you wouldn’t do it if you didn’t have to use a car."}
{"feedback 194": "Taxis are cheap and are normally easy enough to find."}
{"feedback 195": "You need to get to largest vehicle 🚗 you can so that all there know who you aren’t just make sure you only pay with a 💴 yen Canadian money 💵 is colourful not worth much so always carry that stuff you know the stuff but hay THE STUFF !!!"}
{"feedback 196": "Bangkok has all things for everyone, including moving around Bangkok to suit each and everyone from ‘ the wife’ of CEOs of corporate companies, shopaholics, young vivacious girls, English language teachers, Thrills-seekers tourists from China, and Westerners, you name it."}
{"feedback 197": "Is there the best way? Please see for yourself and pick the best way for you."}
{"feedback 198": "For the start, the ‘ wife’ of the company’s CEO or the like of Warren Buffet will fly a chopper from posh shopping mall to posh shopping mall. It costs only 87,500 THB per flight hour, so cheap!"}
{"feedback 199": "All shopaholics will stick to the BTS Sky trains or a sub"}
{"feedback 200": "There are many local transports."}
{"feedback 201": "Use Grab taxi, you can download the app and use it like we use Uber."}
{"feedback 202": "Otherwise Tuk-tuks are also available but they charge too much from travellers."}
{"feedback 203": "There are 4 Train Systems."}
{"feedback 204": "BKK is the hub of the Railway system that runs throughout parts of Thailand. Generally slow, but cheap (3 classes last time I looked- 1st a bit expensive, 2nd a happy medium and 3rd you are fighting off the chickens!) You get what you pay for."}
{"feedback 205": "There is the Airport Metro Link. BKK centre to the Airport. It is cheap enough (less than 100 Baht) , takes 35 minutes and gets you from the Airport to the city."}
{"feedback 206": "Then there are 2 Metro Lines that criss-cross around the city. The Underground MRT and the overground and above the road Sky Train BTS."}
{"feedback 207": "The BTS and MRT link together in a"}
{"feedback 208": "I’d like to clear up the confusion and if possible simplify the answer. Bangkok has long standing slow suburban rail services but we are not going to talk about that. Information obtained from several online sources are often very confusing and many tourists are led to believe there’s only a couple of lines each for the Skytrain( aka BTS )and MRT ( mostly underground) . BTS and MRT are just the names of the owner companies and each has several lines. Additionally there are also other companies that own the other lines 10 in total. There are at the time of writing 192 stations ( with more openi"}
{"feedback 209": "All benefits. Just one minor drawback. If you want to get on the BTS Skytrain at an interchange with the subway you will need to use a different ticket for the latter . However most Bangkokians carry both in their wallets anyway. The different authorities have been arguing for years about having one ticket for all the rapid transit lines as well as the buses and boats . I hope one day they will fairly divide the cake, so to speak , and that’s when we commuters are going to truly benefit."}
{"feedback 210": "When I first arrived in Bangkok the Skytrain line was still being built. The year was early 1999 and if memory serves me correct the Thais were not calling it the Skytrain, instead it was called the ‘lot fai far’ which basically means the electric train in the sky. Nowadays most people simple say BTS. This is one aspect of Thailand that beats America hands down."}
{"feedback 211": "Before we ride the BTS, let’s go back to the states and briefly talk about the subway/trains that I have traveled on. My experience has been somewhat limited but then again many metropolitan cities in America simply don’t have any such"}
{"feedback 212": "In Bangkok there is the subway. Significant part is high above traffic, but some is actual subway. This system is wonderful- and has significantly reduced traffic- in a city with WAY too many cars!"}
{"feedback 213": "I have taken “regular” trains. One that runs on weekends to the Bridge over River Kwai. The other was an overnight sleeping train to Chaing Mai- the ancient capital. Nice sleep both ways (I had three of my children with me !)"}
{"feedback 214": "I think the BTS (aka Skytrain) is one of the best things to have happened to this city."}
{"feedback 215": "Until recently, Bangkok was ranked as one of the world’s top polluted and congested city. While there was plenty of public transport with buses and even canal boats, the roads were more or less constant gridlock."}
{"feedback 216": "Then, at the very end of 1999, the first Skytrain line was opened. Clean, fast, relatively cheap, you could get from one side of the city to the other in 30 minutes instead of hours. What’s not to like? (apart from getting crushed like sardines in a can at peak hours, of course)."}
{"feedback 217": "Then, some years late"}
{"feedback 218": "Here’s a quick rundown of the different public transport options in Bangkok."}
{"feedback 219": "Speedboats and Ferries has traditionally been the primary mode of transport. This includes long speed boats and ferries operating on the canals and the Chao Phraya River. The Bangkok Metropolitan Administration is trialing small electric ferries for use in canals. These will be much quieter to operate than long tail boats."}
{"feedback 220": "They are complimentary .MRT is underground and BTS is Skytrain. MRT encircles Bangkok and BTS traverses central Bangkok. There are several convenient interchange stations."}
{"feedback 221": "Both systems are efficient clean and completely air conditioned and are equally good"}
{"feedback 222": "“A proper…”"}
{"feedback 223": "They do two, they are called the BTS and the MRT. They are both proper and well-equipped. Not as pervasive as they should be, but its expansion is on-going and rapid."}
{"feedback 224": "Thailand also has a reasonable road network. It is irreparably small in Bangkok (km of road to area or population), but extensive up-country. The train network leaves much to be desired…"}
{"feedback 225": "As for you, when will you have the backbone to ask questions using your name?"}
{"feedback 226": "The answer, in short is YES. BKK has excellent and extremely affordable public transportation. BUT it’s multi layered, overlapping, complicated to figure out… and only about 1/3 of the postings are in English… but the path can be discovered if you have patience and aren’t afraid to ask for directions."}
{"feedback 227": "Every trip to Bangkok won’t be completed for visitors without taking the BTS Skytrain."}
{"feedback 228": "As I have relocated to Bangkok for good. I hope my observation below may be in tune with like-minded commuters who use BTS Skytrain as often as I do."}
{"feedback 229": "The public transport in Bangkok is excellent. You can take an Airportlink - a high-speed train that runs around 120 km per hour from Suwannaphumi airport into the city center, then take a BTS or a sky train that runs around 35 km per hour to move around Bangkok. You do need a car or a bike."}
{"feedback 230": "The MRT & BTS railways are good and cheap. The Bangkok traffic means that this is the best way to get around."}
{"feedback 231": "A tip from a former resident, never try to hire a taxi that is parked up, they’ll always try & rip you off. Always hail a moving taxi with his light on. Try and insist that he uses the meter. Taxis are very cheap, I always tip quite well, the drivers are usually quite friendly, and like many Thais, they don’t make much money. Even a small 20 Baht tip is often very much appreciated. I would often give a 100 Baht note (keep the change) for a 73 Baht trip, for example."}
{"feedback 232": "I have been to Bangkok a few times previously about 10 yrs ago. I managed to get around by bus and ferry and skyrail after asking the concierge at my hotel where to visit, how to get around even tho I didn t speak the Thai language. With the help of a tourism map, it s quite easy. Thai people are v polite and helpful."}
{"feedback 233": "I don’t know the latest info re Jakarta but I hear it has quite an expanding metro system already. As for Bangkok we have had the Underground for about 20 years now, and the Skytrain for about 24 years. Together , as of now ,8 lines and 135 stations but 3 more lines will be operational in a few months adding about 60 more stations all over the city"}
{"feedback 234": "Better, the BTS Skytrain is being extended again and a long extension down Sukhumvit just opened. Uber/Grab are so cheap, easy and toll roads are super fast through the day and not too expensive, toll roads aren’t always necessary though and don’t save too much time in general."}
{"feedback 235": "The boat transport system is also brilliant. Buses are good if you buy a bus map from 7/11 first and know your way around town that way."}
{"feedback 236": "Dave & Amy"}
{"feedback 237": "Without question it's got to be Las Vegas. It was an amazing feat of engineering to complete the Amtrak inter City service linking its subway to that of Honolulu ."}
{"feedback 238": "In the United States, and some other countries, a subway is an underground train system. The name can be used for the train itself (as in the phrase “I got on the subway”) or the entire system of trains, tracks, tunnels, and stations."}
{"feedback 239": "A subway system construction is on progress in Jakarta for about one year still running. An MRT systrm exists and running in Jakarta and keep expanding with new destinations around the Jakarta and its suburbans."}
{"feedback 240": "Yes, it is shorthand for rapid transit train or system, akin to ‘underground’ which is what London’s rapid transit system is called. Subway/underground/el/metro trains are electric multiple-unit trains."}
{"feedback 241": "No, it is not but we all have been trying to improve it."}
{"feedback 242": "This year the monorail pink line and yellow line will be commenced the operations linking the nearby provinces with Bangkok, older diesel buses are being gradually replaced by electric buses.\nMINE Smart Ferry has already launched the electric ferry services integrated Nonthaburi province and the Bangkok rail systems through the public piers along the Chao Pharya river."}
{"feedback 243": "In Khonkaen, they have just debuted the prototype of tram under the cooperation between the private sector (Cho Thavee Dollasien PLC) and RMUTI Khonkaen campus."}
{"feedback 244": "Excellent safety record with BTS skytrain, MRT underground train and Airport Link train from airport."}
{"feedback 245": "It costs 45 baht per person to travel from Suwannaphum Airport to the Phaya Thai station in downtown Bangkok which is also BTS station. If your hotel is near a BTS station then take the BTS skytrain from here. Approx 30 baht per person. Depends how far you need to go to get to hotel. If your hotel is near the MRT underground train then get off Airport Link train at Makkasan Station .. then short walk to Phetchburi MRT Station."}
{"feedback 246": "Luggage , this is free but you carry it on and off yourself. If you h"}
{"feedback 247": "I don’t think you can expect an answer for all of Thailand. I believe transportation is being addressed regionally. I understand that Hailand and China are working Goethe’s to build a train between he countries, and Phuket is trying to develop a local transportation system. Both of these projects are years from completion. I’m not aware of any timetable for all of Thailand."}
{"feedback 248": "I would nominate the Montreal Metro. This is for a number of reasons:"}
{"feedback 249": "No, not 24 hours,but it starts at ridiculous o'clock in the morning and runs till quite late at night. Sorry I can't be more specific, but we don't spend much time in Bangkok."}
{"feedback 250": "All subways are trains but not all trains are subways. Subway trains travel primarily underground (hence the “sub”—”beneath”). But many trains travel above ground—I just travelled from NYC to San Diego and back on a train and it was not a subway… great trip, by the way. In NYC I use the subway all the time; it’s a fantastic way to get where you’re going within the five boroughs for $2.75 a trip."}
{"feedback 251": "Not one smart dude has that sort of expectation when entering Bangkok, I don’t think anyone would bother whether or not, Bangkok excels in Public transport."}
{"feedback 252": "Di Caprio, never had that in his head when he roamed ‘Khao San road’ and got to be a witness at Bangkok’s police station where nobody spoke English, and he had a Songthaew’s ( open -sided mini van) ride in ‘The Beach’"}
{"feedback 253": "The Hangover 2 didn’t even feature how great Bangkok’s Public buses was. All of them enjoyed a Chao Phraya River’s boat ride and a Songthaew’s ride to the extreme."}
{"feedback 254": "They love Bangkok the way it is."}
{"feedback 255": "I’ve come thus far, let’s forget"}
{"feedback 256": "Along with the BTS Skytrain and the Airport Rail Link, the MRT is part of Bangkok's rail transportation infrastructure. The two MRT lines have 470,000 passengers each day (Blue Line 400,000 and Purple Line 70,000) with 45 operational stations and a combined route length of 60 kilometers (37 mi)"}
{"feedback 257": "Pubic transportation in Thailand is safe, but due to the traffic congestion, it may be accounted as unreliable."}
{"feedback 258": "I would nominate Moscow - it is a huge city in both population and sq. km’s. and their subway is always clean, and amazingly beautiful. As a runner up, I suggest Prague. Also beautiful and very clean. It almost never breaks down and is very reliable (i lived there for most of the 1990’s)."}
{"feedback 259": "Hey there, fellow travel enthusiast! I recently explored Bangkok and while I wouldn't say it's the absolute best in Asia (subjective, right?), the public transport system definitely impressed me! Here's my take:\nPros: BTS Skytrain: Super sleek and efficient, covers major tourist areas. Think of it as Bangkok's \"mass transit MVP.\"\nMRT: Another subway option, expanding its reach all the time. Great for longer commutes or avoiding traffic jams.\nBuses: Extensive network, super affordable, but can get crowded and confusing for first-timers.\nCanal boats: Unique and scenic way to travel, especially"}
{"feedback 260": "Yes, they do. France/Paris, Great Britian/London, Russia/Moscow are a few others I know of."}
{"feedback 261": "I think it’s a good idea."}
{"feedback 262": "Yes, Bangkok does have a metro system. The Bangkok Mass Transit System, commonly known as the BTS or Skytrain, is an elevated rapid transit system that serves the city of Bangkok, Thailand. In addition to the BTS, Bangkok also has the MRT (Mass Rapid Transit), an underground metro system that complements the BTS in providing convenient transportation around the city. The BTS and MRT systems connect various important locations in Bangkok, making it easier for both locals and tourists to navigate the city."}
{"feedback 263": "If you’re asking whether the city has a subway or commuter rail system, the answer is, yes, it does."}
{"feedback 264": "It’s a very nice system — or more correctly — set of interconnected systems."}
{"feedback 265": "About two decades ago, two systems were opened."}
{"feedback 266": "The BTS skytrain is was an elevated train line that ran predominately east-west along Sukhumvit Road, with a shorter second line that ran from the river to the Silom area. It was the first such train system to open for operation in Bangkok, and it began operation in the late 1990s."}
{"feedback 267": "A second system, an underground subway called the MRT that opened around the start of the new m"}
{"feedback 268": "Here’s a quick rundown of the different public transport options in Bangkok."}
{"feedback 269": "Speedboats and Ferries has traditionally been the primary mode of transport. This includes long speed boats and ferries operating on the canals and the Chao Phraya River. The Bangkok Metropolitan Administration is trialing small electric ferries for use in canals. These will be much quieter to operate than long tail boats."}
{"feedback 270": "Okay, as I’ve lived(endure) through that long subway building process in BKK as a city commuter, I’ll attempt to answer this one."}
{"feedback 271": "First, as Bangkok is situated on the river delta, we are barely 1 meter above sea level. This simply means where ever you dig into the ground, water tends to gushing out. This creates more issue for the subway construction, as bore a very big hole while keeping the whole site water-tight is much more difficult than simply bore a very big hole.. think a sort of subway + Channel Tunnel project and you get an idea."}
{"feedback 272": "Second, since our soil is mushy soft and easy to dig int"}
